---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.StructuralType.Column
enum: Autodesk.Revit.DB.Structure.StructuralType
zh: 柱、柱子
source: html/0a0a3793-5fce-283d-4953-a137f5593db9.htm
---
# Autodesk.Revit.DB.Structure.StructuralType.Column

**中文**: 柱、柱子

Structural Column